Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: However, if you prefer using private fields with getters/setters, that's totally fine and will work perfectly as long as the getters/setters follow the JavaBeans naming convention (`getSomething()`/`isSomething()`/`setSomething(...)`).
ja_jp: ただし、getter/setter 付きのプライベートフィールドを使用する場合は、 getter/setter が JavaBeans の命名規則に従っている限りは、まったく問題はなく、完璧に動作します (`getSomething()`/`isSomething()`/`setSomething(...)`)。

source: However, if you really need to instantiate a bean eagerly you can:
ja_jp: ただし、Bean の性急なインスタンス化が必要な場合は、次のことができます。

source: However, if you really need to instantiate a bean eagerly, you can:
ja_jp: ただし、Bean を即座に (eagerly) インスタンス化する必要がある場合は、次のことができます。

source: However, if you want to insert scripts, styles, and libraries in your web pages, you have 3 options:
ja_jp: ただし、Web ページにスクリプト、スタイル、ライブラリーを挿入する場合は、次の 3 つのオプションがあります。

source: However, in certain environments, such as when running a Quarkus application in a container within a Kubernetes cluster, this connection might not be possible. For example, if the application runs in one pod and the database in another, the database may not be reachable at startup time. To address this, Quarkus provides an _offline startup_ mode, which allows Hibernate to skip connecting to the database during application startup.
ja_jp: ただし、Kubernetes クラスター内のコンテナーで Quarkus アプリケーションを実行する場合など、特定の環境では、この接続が不可能な場合があります。たとえば、アプリケーションが特定のポッドで実行され、データベースが別のポッドで実行されている場合、起動時にデータベースに到達できない可能性があります。これに対処するために、Quarkus は Hibernate がアプリケーションの起動中にデータベースへの接続をスキップできるようにする「オフライン起動」モードを提供しています。

source: However, in cloud-native apps, using a database to store transaction logs has additional requirements. The `narayana-jta` extension, which manages these transactions, requires stable storage, a unique reusable node identifier, and a steady IP address to work correctly. While the JDBC object store provides a stable storage, users must still plan how to meet the other two requirements.
ja_jp: しかし、クラウドネイティブアプリでは、トランザクションログを保存するためにデータベースを使用すると、追加の要件があります。 これらのトランザクションを管理する `narayana-jta` エクステンションが正しく動作するには、安定したストレージ、再利用可能な一意のノード識別子、安定した IP アドレスが必要です。 JDBCオブジェクトストアは安定したストレージを提供しますが、ユーザーは他の2つの要件を満たす方法を計画する必要があります。

source: However, in native mode, this implies registering for reflection model types that you very likely won't use in your application. You can mitigate this by providing a more granular project configuration and depending only on those models you are sure the application uses.
ja_jp: しかし、ネイティブモードでは、これはアプリケーションでまず使用しないであろうモデルタイプをリフレクション用に登録することを意味します。よりきめ細かなプロジェクト設定を提供し、アプリケーションが使用すると確信しているモデルのみに依存することで、これを軽減できます。

source: However, in some environments, this alternative DNS client may be unable to resolve `SRV` records. If you encounter such issues, you can revert to the MongoDB driver’s default DNS client by setting the following properties:
ja_jp: しかし、環境によってはこの代替 DNS クライアントが `SRV` レコードを解決できないことがあります。そのような問題が発生した場合は、次のプロパティを設定することで MongoDB ドライバのデフォルト DNS クライアントに戻すことができます：

source: However, in some situations, these classes cause the `JAXBContext` to fail: for example, when you're using the same class name in different java packages. In these cases, the application will fail at build time and print the JAXB exception that caused the issue, so you can properly fix it. Alternatively, you can also exclude the classes that cause the issue by using the property `quarkus.jaxb.exclude-classes`. When excluding classes that are required by any resource, the JAXB Quarkus REST extension will create and cache a custom `JAXBContext` that will include the excluded class, causing a minimal performance degradance.
ja_jp: しかし、状況によっては、これらのクラスが原因で `JAXBContext` が失敗することがあります。例えば、異なる Java パッケージで同じクラス名を使用している場合などです。このような場合、アプリケーションはビルド時に失敗し、問題の原因となったJAXB例外が出力されるので、適切に修正することができます。また、 `quarkus.jaxb.exclude-classes` というプロパティを使用して、問題の原因となるクラスを除外することもできます。任意のリソースで必要とされるクラスを除外する場合、JAXB Quarkus REST エクステンションは、除外されたクラスを含むカスタム `JAXBContext` を作成およびキャッシュするため、パフォーマンスの低下は最小限に抑えられます。

source: However, in some situations, these classes cause the `JAXBContext` to fail: for example, when you're using the same class name in different java packages. In these cases, the application will fail at build time and print the JAXB exception that caused the issue, so you can properly fix it. Alternatively, you can also exclude the classes that cause the issue by using the property `quarkus.jaxb.exclude-classes`. When excluding classes that are required by any resource, the JAXB resteasy reactive extension will create and cache a custom `JAXBContext` that will include the excluded class, causing a minimal performance degradance.
ja_jp: しかし、状況によっては、これらのクラスが原因で `JAXBContext` が失敗することがあります。例えば、異なる Java パッケージで同じクラス名を使用している場合などです。このような場合、アプリケーションはビルド時に失敗し、問題の原因となったJAXB例外が出力されるので、適切に修正することができます。また、 `quarkus.jaxb.exclude-classes` というプロパティを使用して、問題の原因となるクラスを除外することもできます。任意のリソースで必要とされるクラスを除外する場合、JAXB RESTEasy reactive エクステンションは、除外されたクラスを含むカスタム `JAXBContext` を作成およびキャッシュするため、パフォーマンスの低下は最小限に抑えられます。

source: However, in the case of ``ConstraintValidator``s that are dependent of attributes of the constraint annotation (typically when implementing the `initialize(A constraintAnnotation)` method), use the `@Dependent` scope to make sure each annotation context has a separate instance of the `ConstraintValidator` bean.
ja_jp: ただし、制約アノテーションの属性に依存する `ConstraintValidator` の場合（通常、 `initialize(constraintAnnotation)` メソッドを実装する場合）、 `@Dependent` スコープを使用して、各アノテーションコンテキストが `ConstraintValidator` Beanの個別のインスタンスを持つようにします。

source: However, in this particular case the section helper factory is ignored during validation at build time. If you want to register a section that participates in validation of templates at build time then use the convenient `@EngineConfiguration` annotation:
ja_jp: ただし、この特定のケースでは、ビルド時の検証でセクションヘルパーファクトリーは無視されます。 ビルド時のテンプレート検証に参加する登録する場合は、便利な `@EngineConfiguration` アノテーションを使用します。

source: However, instead of providing the password as plain-text in the configuration file (which is considered bad practice), it can instead be supplied (using link:https://github.com/eclipse/microprofile-config[MicroProfile Config]) as the environment variable `QUARKUS_HTTP_SSL_CERTIFICATE_KEY_STORE_PASSWORD`. This will also work in tandem with link:https://kubernetes.io/docs/concepts/configuration/secret/#using-secrets-as-environment-variables[Kubernetes secrets].
ja_jp: しかし、設定ファイルでパスワードをプレーンテキストとして提供する代わりに (これは悪い習慣と考えられています)、環境変数 `QUARKUS_HTTP_SSL_CERTIFICATE_KEY_STORE_PASSWORD` として ( link:https://microprofile.io/project/eclipse/microprofile-config[MicroProfile config ] を使用して) パスワードを提供することができます。これは、 link:https://kubernetes.io/docs/concepts/configuration/secret/#using-secrets-as-environment-variables[Kubernetes secrets] と連動します。

source: However, it is also possible to select alternatives for an application using the unified configuration. The `quarkus.arc.selected-alternatives` property accepts a list of string values that are used to match alternative beans. If any value matches then the priority of `Integer#MAX_VALUE` is used for the relevant bean. The priority declared via `@Priority` or `@AlternativePriority` is overridden.
ja_jp: ただし、統一された設定を使用して、アプリケーションの代替を選択することもできます。 `quarkus.arc.selected-alternatives` プロパティーは、代替 Bean を照合するために使用される文字列値のリストを受け入れます。一致する値がある場合は、関連する Bean に `Integer#MAX_VALUE` の優先順位が使用されます。 `@Priority` または `@AlternativePriority` で宣言された優先度は上書きされます。

source: However, it is also possible to select alternatives for an application using the unified configuration. The `quarkus.arc.selected-alternatives` property accepts a list of string values that are used to match alternative beans. If any value matches then the priority of `Integer#MAX_VALUE` is used for the relevant bean. The priority declared via `@Priority` or inherited from a stereotype is overridden.
ja_jp: ただし、統合設定を使用して、アプリケーションの代替を選択することもできます。 `quarkus.arc.selected-alternatives` プロパティーは、代替 Bean を照合するために使用される文字列値のリストを受け入れます。 一致する値がある場合は、関連する Bean に `Integer#MAX_VALUE` の優先順位が使用されます。 `@Priority` で宣言された優先度またはステレオタイプで継承された優先度は上書きされます。

source: However, it is also possible to select alternatives for an application using the unified configuration. The `quarkus.arc.selected-alternatives` property accepts a list of string values that are used to match alternative beans. If any value matches, then the priority of `Integer#MAX_VALUE` is used for the relevant bean. The priority declared via `@Priority` or inherited from a stereotype is overridden.
ja_jp: ただし、統合設定を使用してアプリケーションの代替を選択することもできます。`quarkus.arc.selected-alternatives` プロパティーは、代替 Bean を照合するために使用される文字列値のリストを受け入れます。いずれかの値が一致すると、関連する Bean に `Integer#MAX_VALUE` の優先度が使用されます。`@Priority` で宣言された優先度、またはステレオタイプから継承された優先度は上書きされます。

source: However, it is also possible to specify the profile directly in the POM file of the project using project properties, the Quarkus Maven plugin configuration properties or system properties set in the Quarkus Maven plugin configuration.
ja_jp: ただし、プロジェクトプロパティー、Quarkus Maven プラグイン設定プロパティー、または Quarkus Maven プラグイン設定で設定されたシステムプロパティーを使用して、プロジェクトの POM ファイルでプロファイルを直接指定することもできます。

source: However, it is likely that your Keycloak configuration is more complex and requires setting more properties.
ja_jp: ただし、Keycloak の設定がより複雑になり、より多くのプロパティーの設定が必要になる可能性があります。

source: However, it is likely your Keycloak configuration may be more complex and require setting more properties.
ja_jp: ただし、Keycloak の設定はこれよりも複雑で、より多くのプロパティーを設定する必要があると思われます。

source: However, it is possible to specify the matching name with `matchName()`.
ja_jp: ただし、 `matchName()` でマッチング名を指定することは可能です。

source: However, it is possible to store passwords as plain text with the `@Password(PasswordType.CLEAR)` annotation when operating in a test environment.
ja_jp: ただし、テスト環境で運用する場合は、 `@Password(PasswordType.CLEAR)` のアノテーションでパスワードを平文で保存することが可能です。

source: However, it may also accept the following parameters:
ja_jp: ただし、次のパラメーターも受け入れる場合があります。

source: However, it's also not needed because Quarkus own default exporters will send data using the OTLP protocol.
ja_jp: しかし、Quarkus 独自のデフォルトエクスポーターが OTLP プロトコルを使用してデータを送信するため、これは必要ありません。

source: However, it's possible to use the `quarkus.qute.dev-mode.no-restart-templates` configuration property to specify the templates for which the application is not restarted. The configration value is a regular expression that matches the template path relative from the `templates` directory and `/` is used as a path separator. For example, `quarkus.qute.dev-mode.no-restart-templates=templates/foo.html` matches the template `src/main/resources/templates/foo.html`. The matching templates are reloaded and only runtime validations are performed.
ja_jp: ただし、 `quarkus.qute.dev-mode.no-restart-templates` 設定プロパティーを使用して、アプリケーションを再起動しないテンプレートを指定することは可能です。 設定値は、 `templates` ディレクトリーからの相対テンプレートパスに一致する正規表現であり、パス区切り文字として `/` が使用されます。 たとえば、 `quarkus.qute.dev-mode.no-restart-templates=templates/foo.html` はテンプレート `src/main/resources/templates/foo.html` と一致します。 一致するテンプレートがリロードされ、実行時の検証のみが実行されます。

source: However, it's possible to use the `quarkus.qute.dev-mode.no-restart-templates` configuration property to specify the templates for which the application is not restarted. The configuration value is a regular expression that matches the template path relative from the `templates` directory and `/` is used as a path separator. For example, `quarkus.qute.dev-mode.no-restart-templates=templates/foo.html` matches the template `src/main/resources/templates/foo.html`. The matching templates are reloaded and only runtime validations are performed.
ja_jp: ただし、`quarkus.qute.dev-mode.no-restart-templates` 設定プロパティーを使用して、アプリケーションを再起動しないテンプレートを指定することは可能です。 設定値は、`templates` ディレクトリーからの相対テンプレートパスに一致する正規表現であり、パス区切り文字として `/` が使用されます。 たとえば、`quarkus.qute.dev-mode.no-restart-templates=templates/foo.html` はテンプレート `src/main/resources/templates/foo.html` と一致します。 一致するテンプレートがリロードされ、実行時の検証のみが実行されます。

source: However, many OIDC providers such as Keycloak, Okta, Auth0, and Microsoft ADFS offer OIDC to SAML 2.0 bridges. You can create an identity broker connection to a SAML 2.0 provider in your OIDC provider and use `quarkus-oidc` to authenticate your users to this SAML 2.0 provider, with the OIDC provider coordinating OIDC and SAML 2.0 communications. As far as Quarkus endpoints are concerned, they can continue using the same Quarkus Security, OIDC API, annotations such as `@Authenticated`, `SecurityIdentity`, and so on.
ja_jp: しかし、Keycloak、Okta、Auth0、Microsoft ADFS などの多くの OIDC プロバイダは、OIDC から SAML 2.0 へのブリッジを提供しています。 OIDCプロバイダでSAML 2.0プロバイダへのIDブローカー接続を作成し、 `quarkus-oidc` 、OIDCプロバイダがOIDCとSAML 2.0の通信を調整しながら、ユーザーをこのSAML 2.0プロバイダで認証することができます。 Quarkusエンドポイントに関しては、同じQuarkusセキュリティ、OIDC API、 `@Authenticated` 、 `SecurityIdentity` などのアノテーションを使用し続けることができます。

source: However, many OIDC providers, such as Keycloak, Okta, Auth0, and Microsoft ADFS, offer bridges from OIDC to SAML 2.0. You can create an identity broker connection to a SAML 2.0 provider in your OIDC provider and use `quarkus-oidc` to authenticate your users to this SAML 2.0 provider, with the OIDC provider coordinating OIDC and SAML 2.0 communications.
ja_jp: ただし、Keycloak、Okta、Auth0、Microsoft ADFS などの多くの OIDC プロバイダーは、OIDC から SAML 2.0 へのブリッジを提供しています。 OIDC プロバイダーで SAML 2.0 プロバイダーへのアイデンティティーブローカー接続を作成し、 `quarkus-oidc` を使用してこの SAML 2.0 プロバイダーに対してユーザーを認証し、OIDC プロバイダーが OIDC と SAML 2.0 の通信を調整することができます。

source: However, most of the other connectors handle context propagation dispatching messages on separate duplicated Vert.x contexts.
ja_jp: ただし、他のほとんどのコネクターは、個別の複製された Vert.x コンテキストで、コンテキスト伝播ディスパッチメッセージを処理します。

source: However, not all applications optimize for those dimensions. Some prioritize peak throughput, development velocity, debuggability, and compatibility with existing tooling. This is where Leyden becomes interesting, aiming to improve startup and footprint while staying closer to the traditional JVM model.
ja_jp: しかし、すべてのアプリケーションがこれらの側面を最適化するわけではありません。一部のアプリケーションは、ピークスループット、開発速度、デバッグ容易性、既存ツールとの互換性を優先します。ここで Leyden が興味深いものになります。これは、従来の JVM モデルに近いままで、起動とフットプリントの改善を目指します。

source: However, note that there's no Dev Services support for running Confluent Schema Registry itself. If you want to use a running instance of Confluent Schema Registry, configure its URL, together with the URL of a Kafka broker:
ja_jp: ただし、Confluent Schema Registry 自体の実行に対する Dev Services のサポートはないことに注意してください。Confluent Schema Registry の実行インスタンスを使用する場合は、その URL を Kafka ブローカーの URL と併せて設定します。

source: However, please note, directly inlining the private keys in the configuration is not recommended. Use the `smallrye.jwt.sign.key` property only if you need to fetch a signing key value from the remote secret manager.
ja_jp: ただし、設定に秘密鍵を直接インライン化することはお勧めしません。リモートシークレットマネージャーから署名キー値を取得する必要がある場合にのみ、 `smallrye.jwt.sign.key` プロパティーを使用してください。

source: However, running tests is also essential, lets see how we can test the endpoint and configuration which you have developed during the course of this tutorial, using xref:continuous-testing.adoc[Quarkus Continuous Testing] feature.
ja_jp: しかし、テストの実行も重要です。ここでは、xref:continuous-testing.adoc[Quarkus 継続的テスト] 機能を使用して、このチュートリアルを実施する中で開発したエンドポイントと設定をテストする方法を説明します。

source: However, say our client requires both films with filmId `0` and `1`. In a REST API the client would have to make two calls to the API. Therefore, the client would be `Under-fetching`.
ja_jp: しかし、クライアントが filmId `0` と `1` の両方の映画を必要とするとします。REST APIでは、クライアントはAPIに2回コールする必要があります。したがって、クライアントは `Under-fetching` となります。

source: However, some applications require access to the current JWT token in order to formulate a correct JWK key request. `quarkus.oidc.jwks.resolve-early=false` delays the JWK key retrieval until the moment the first JWT token arrives. And since the token content determines which JWK keys should be used to verify it, a number of verification keys can be potentially large, therefore, when the JWKs have to be retrieved at the request time, `quarkus.oidc.jwks.cache-size`, `quarkus.oidc.jwks.cache-time-to-live` and `quarkus.oidc.jwks.clean-up-timer-interval` properties can be used to control the JWK cache.
ja_jp: ただし、一部のアプリケーションでは、正しい JWK キーリクエストを作成するために現在の JWT トークンにアクセスする必要があります。 `quarkus.oidc.jwks.resolve-early=false` は、最初の JWT トークンが到着するまで JWK キーの取得を遅らせます。そして、トークンの内容によって検証に使用すべき JWK キーが決まるため、検証キーの数が潜在的に多くなる可能性があります。したがって、リクエスト時に JWK を取得する必要がある場合、 `quarkus.oidc.jwks.cache-size` 、 `quarkus.oidc.jwks.cache-time-to-live` 、および `quarkus.oidc.jwks.clean-up-timer-interval` の設定プロパティーを使用して JWK キャッシュを制御できます。

source: However, some exception types in Java only serve as wrappers for other exceptions. Often, checked exceptions are wrapped into `RuntimeException` just to not have them declared in method `throws` parameters. Working with `CompletionStage` for example, will require `CompletionException`. There are many such exception types that are just wrappers around the real cause of the exception.
ja_jp: ただし、Java の一部の例外タイプは、他の例外のラッパーとしてのみ機能します。多くの場合、チェック済み例外は、メソッドの `throws` パラメーターで宣言されないようにするために `RuntimeException` にラップされます。 たとえば、 `CompletionStage` を操作するには、 `CompletionException` が必要になります。このような例外タイプは、例外の実際の原因をラップするだけのものが多数あります。

source: However, some extensions do define properties _overridable at runtime_. A simple example is the database URL, username and password which is only known specifically in your target environment, so they can be set and influence the application behaviour at runtime.
ja_jp: しかし、いくつかのエクステンションは _実行時にオーバーライド可能な_ プロパティーを定義しています。定型的な例としては、データベースの URL、ユーザー名とパスワードがあります。これはターゲット環境によって定まるものであり、実行時にセットされ、アプリケーションの動作に影響を与えるものです。

source: However, sometimes string-based qualifiers are necessary. In that case, avoid the `@Named` qualifier, because in CDI, it works differently to all other qualifiers.
ja_jp: しかし、文字列ベースの修飾子が必要になることもあります。その場合は、`@Named` 修飾子の使用は避けてください。CDI では、他のすべての修飾子とは異なる動作をするためです。

source: However, such a feature must only be used with duplicated contexts. As said above, it's transparent for the code. A duplicated context is a context, so they expose the same API.
ja_jp: ただし、このような機能は複製コンテキストでのみ使用する必要があります。 上述したように、コードにとっては透過的です。 複製コンテキストはコンテキストなので、同じAPIを公開します。

source: However, such parameters may also be returned to Quarkus with the POST form payload directly in the request body. It is achieved by the provider returning an HTML page to the user and this page auto-submitting the form payload to Quarkus. Some providers such as xref:security-openid-connect-providers.adoc#apple[Apple] can enforce this response mode. Set `quarkus.oidc.authentication.response-mode=form` if supporting this mode is required. Also note that in this case, setting `quarkus.oidc.authentication.remove-redirect-parameters=true` is not necessary, since the `code` and other parameters are submitted in the request body.
ja_jp: ただし、これらのパラメーターは、リクエストボディー内の POST フォームペイロードとして直接 Quarkus に返されることもあります。これは、プロバイダーがユーザーに HTML ページを返し、そのページがフォームペイロードを Quarkus に自動送信することで実現されます。 xref:security-openid-connect-providers.adoc#apple[Apple] などの一部のプロバイダーは、このレスポンスモードを強制する場合があります。このモードをサポートする必要がある場合は、 `quarkus.oidc.authentication.response-mode=form` を設定してください。また、この場合、 `code` やその他のパラメーターはリクエストボディーで送信されるため、 `quarkus.oidc.authentication.remove-redirect-parameters=true` を設定する必要はありません。

source: However, the best action is that if for whatever reason you do have log4j-core on your classpath and configured to log, that you ensure it is upgraded to version 2.16 or higher.
ja_jp: しかしながら、もし何らかの理由でクラスパスにlog4j-coreがあり、ログを取るように設定されているならば、最善の行動は、それがバージョン2.16以上にアップグレードされていることを確認することです。

source: However, the direct end to end Bearer token propagation should be avoided if possible. For example, `Client -> Service A -> Service B` where `Service B` receives a token sent by `Client` to `Service A`. In such cases `Service B` will not be able to distinguish if the token came from `Service A` or from `Client` directly. For `Service B` to verify the token came from `Service A` it should be able to assert a new issuer and audience claims.
ja_jp: ただし、可能であれば、エンドツーエンドのベアラートークンの直接伝播は避ける必要があります。たとえば、 `Client -> Service A -> Service B` で、 `Service B` は `Client` から `Service A` に送信されたトークンを受け取ります。このような場合、 `Service B` は、トークンが `Service A` からのものか、直接 `Client` からのものかを区別できません。トークンが `Service A` からのものであることを `Service B` が確認するには、新しい発行者とオーディエンスのクレームをアサートできる必要があります。

source: However, the direct end-to-end Bearer token propagation should be avoided. For example, `Client -> Service A -> Service B` where `Service B` receives a token sent by `Client` to `Service A`. In such cases, `Service B` cannot distinguish if the token came from `Service A` or from `Client` directly. For `Service B` to verify the token came from `Service A`, it should be able to assert a new issuer and audience claims.
ja_jp: ただし、エンドツーエンドのベアラートークンの直接的な伝播は避ける必要があります。たとえば、 `Client -> Service A -> Service B` の場合、 `Service B` は `Client` から `Service A` に送信されたトークンを受信します。このような場合、 `Service B` はトークンが `Service A` から送信されたのか、直接 `Client` から送信されたのかを区別できません。 `Service B` で、トークンの送信元が `Service A` であることを確認するには、新しい発行者とオーディエンスのクレームをアサートできる必要があります。

source: However, the image and
ja_jp: しかし、イメージと

source: However, the keys cannot be used directly. Instead, a prefix is used to avoid possible collisions with variables from the outer scope. By default, the alias of an iterated element suffixed with an underscore is used as a prefix. For example, the `hasNext` key must be prefixed with `it_` inside an `{#each}` section: `{it_hasNext}`.
ja_jp: しかし、キーを直接使うことはできません。 その代わり、外部スコープの変数と競合する可能性を避けるために、接頭辞が使用されます。 デフォルトでは、反復処理された要素のエイリアスの後にアンダースコアを付けたものが接頭辞として使用されます。 たとえば、`{#each}` セクション (`{it_hasNext}`) の中では、`hasNext` キーは `it_` を接頭辞として使用する必要があります。

source: However, the question we’re trying to answer here is: what would be the bottleneck of such code? Is it appending the characters? Is it deleting it? Is it checking whether the thread is alive?
ja_jp: しかし、ここで私たちが答えようとしているのは、そのようなコードのボトルネックは何か？文字を追加することか？削除していることか？スレッドが生きているかどうかをチェックしていることか？です。

source: However, there are many more options within the Vert.x HTTP Client to configure the connections. See all the options in the Vert.x HTTP Client Options API in https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClientOptions.html[this link].
ja_jp: しかし、Vert.x HTTP Client 内には、接続を設定するための多くのオプションがあります。 https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClientOptions.html[このリンク] のVert.x HTTP Client Options API ですべてのオプションを参照してください。

source: However, there could be cases where JWT tokens must be verified via the introspection only. It can be forced by configuring an introspection endpoint address only, for example, in case of Keycloak you can do it like this:
ja_jp: ただし、JWT トークンをイントロスペクションのみで検証する必要がある場合があります。イントロスペクションエンドポイントアドレスのみを設定することで強制できます。たとえば、Keycloak の場合は、次のように設定できます。

source: However, there is one key difference: index updates are necessarily asynchronous; they are guaranteed to happen _eventually_, but not immediately.
ja_jp: しかし重要な違いが1つあります。インデックスの更新は必然的に非同期で行われ、 _いつかは_ 行われることが保証されますが、すぐには行われません。

source: However, this class is also the output of the solution:
ja_jp: ただし、このクラスはソリューションの出力でもあります。

source: However, this comes with a few drawbacks:
ja_jp: しかし、これにはいくつかの欠点があります。

source: However, this depends on the extension, as each needs to be converted to the new model. The Redis, Lambda, Narayana, and Kafka extensions have been converted so far. You can track progress on conversions by following the sub-issues in https://github.com/quarkusio/quarkus/issues/45785[#45785]. As a workaround, if extensions you depend on have not yet been converted, splitting conflicting tests into separate projects should fix symptoms.
ja_jp: ただし、これは各エクステンションを新しいモデルに変換する必要があるため、エクステンションに依存します。これまでに Redis、Lambda、Narayana、Kafka のエクステンションが変換されました。変換の進捗状況は、 https://github.com/quarkusio/quarkus/issues/45785[#45785] のサブイシューで確認できます。回避策として、依存しているエクステンションがまだ変換されていない場合は、競合するテストを別々のプロジェクトに分割することで症状が解消されるはずです。
